Repository: bryanjudetoh/capstone-flutter-app
Catalog: lib/l10n/app_*.arb
Languages: mn

# language
source: English
mn: Монгол

source: Sign Up
mn: Бүртгүүлэх

source: Register
mn: Бүртгүүлэх

# signupFB
source: Sign Up With Facebook
mn: Фэйсбүүкээр бүртгүүлнэ үү

# verification
source: Pending Verification
mn: Баталгаажуулалт

source: Log In
mn: Нэвтрэх

source: Forgot Password
mn: Нууц үгээ мартсан

source: Change Password
mn: Нууц үгээ өөрчлөх

source: Profile
mn: Профайл

source: Edit Profile
mn: Засах Профайл

source: Notifications
mn: Мэдэгдэл

source: Activities
mn: Үйл ажиллагаа

source: Organisation
mn: Байгууллага

source: Organisation Details
mn: Байгууллагын дэлгэрэнгүй мэдээлэл

source: Scholarship
mn: Тэтгэлэг

source: Internship
mn: Дадлага ажил

source: Mentorship
mn: Менторшип

source: Enrichment Courses
mn: Сургалт

source: Online Courses
mn: Онлайн Курсууд

source: Offline Courses
mn: Офлайн Курсууд

source: Volunteering
mn: Сайн дурын ажил хийх

source: Sports
mn: Спорт

source: See more
mn: Бүгдийг харах
